# yolov8-rail.yaml
nc: 1 # только один класс: дефект
scales: # берем версию 'n' (nano) для максимальной скорости 900 FPS
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]] # соединение с P4
  - [-1, 3, C2f, [512]] # 12 (P4/16-head)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # соединение с P5
  - [-1, 3, C2f, [1024]] # 15 (P5/32-head)

  - [[12, 15], 1, Detect, [nc]] # Детекция только на слоях 16 и 32